from client import Translator


translator = Translator()
for i in range(1000000):
    print(i)
    dest = translator.translate(text="ពិធីកោតសរសើរនិស្សិតឆ្នើមឡាវ - កម្ពុជា ឆ្នាំ ២០២០ នារសៀលថ្ងៃទី ២២ ខែវិច្ឆិកា សម្ព័ន្ធសមាគមយុវជនទីក្រុងហូជីមិញបានរៀបចំកម្មវិធីកោតសរសើរចំពោះនិស្សិតឆ្នើមឡាវនិងកម្ពុជា ឆ្នាំ ២០២០ ក្នុងនោះមាននិស្សិតឆ្នើមឡាវចំនួន ៦១ នាក់និងនិស្សិតឆ្មើមកម្ពុជា ចំនួន ៦១ នាក់ ដែលកំពុងសិក្សានៅទូទាំងទីក្រុងហូជីមិញ។ ក្នុងឱកាសនេះ និស្សិតឆ្នើមទាំងឡាវនិងកម្ពុជានឹងទទួលបានប័ណ្ណសរសើរពីសម្ព័ន្ធសមាគមយុវជនទីក្រុងហូជីមិញផងដែរ។ តាមរយៈពេល ១៤ ឆ្នាំ រហូតមកដល់ពេលនេះ កម្មវិធីក៏បានលើកតំកើងនិស្សិតឆ្នើមឡាវនិងកម្ពុជា ចំនួន ៩០១ នាក់ ដែលកំពុងសិក្សានៅតាមសាកលវិទ្យាល័យនិងវិទ្យាស្ថាននានាក្នុងទីក្រុងហូជីមិញ៕", dest="vi", src="km")
    print('des', dest)
